{
  "main": {
    "name": "Stephen Chang",
    "occupation": "software engineer @ Amazon",
    "description": ", working as part of the Operations Technology org",
    "image": "profilepic.jpg",
    "bio": "Hi, my name is Stephen Chang! Originally from Houston, I'm currently residing in Seattle, where I work as a software engineer at Amazon within the Operations Technology organization. Outside of working, I'm actively thinking of my future startups, new cooking recipes, and any acting opportunities! 😊",
    "contactmessage": "For any inquiries, reach out to me at stephen8chang@gmail.com!!",
    "email": "stephen8chang@gmail.com",
    "phone": "832-795-7279",
    "address": {
      "street": "736 Bellevue Pl E",
      "city": "Seattle",
      "state": "Washington",
      "zip": "98102"
    },
    "website": "",
    "resumedownload": "https://drive.google.com/file/d/1FRTd2dYC5kJ2uFxtpRv18f-6OgQFU67z/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/profile.php?id=100010115528655",
        "className": "fa fa-facebook"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/stephen8chang/",
        "className": "fa fa-instagram"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/stephen8chang/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/stephen8chang",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Just some of the many skills under my belt!",
    "education": [
      {
        "school": "University of Texas at Austin",
        "degree": "Bachelor's in Electrical and Computer Engineering, Minor in Business",
        "graduated": "May 2022",
        "description": "Student Engineering Council (Academic Affairs, Service, Marketing + Analytics Committee and Ultimate Frisbee Team Captain), E-Week App Team (Project Manager), Foot in the Door Theatre (Jim O'Connor in The Glass Menagerie), Texas Convergent (Technical Project Lead), Asian Business Students Association (Executive Branch Director), Student Engineers Educating Kids (Student Mentor)"
      }
    ],
    "work": [
      {
        "company": "Amazon",
        "title": "Incoming Software Development Engineer",
        "years": "August 2022 - Present",
        "description": "Working within the Operations Technology org"
      },
      {
        "company": "Orbee",
        "title": "Associate Software Engineer",
        "years": "January 2022 - May 2022",
        "description": "• Executed major overhauls in company databases by creating a table importer microservice to synchronize table imports from AWS S3 to local databases, reducing internal user time spent querying for data entries by 50% • Created new endpoints to copy and archive email templates in user profiles using Ruby on Rails • Implemented click tracker injector component using SendGrid APIs, Nokogiri, and Regex to be used in 100% of future Outlook emails sent through the email marketing department • Wrote over 80 PostgreSQL queries to hotfix multiple user microservice errors related to email campaigns • Configured multi-database support for email marketing service using Terraform"
      },
      {
        "company": "Goldman Sachs",
        "title": "Summer Tech Analyst (SWE)",
        "years": "June 2021 - August 2021",
        "description": "• Streamlined creation of fraud concerns page for Marcus (an online-only bank) using React Redux, reducing agent communication between Goldman Sachs fraud microservices by 150% • Coordinated and engineered agent-client interactions component, reducing overall operations costs by 30% • Developed REST APIs in Java (Spring Boot) with server-side pagination to connect fraud concerns page and agent-client interactions component to customer profile microservices • Led communication with QA in Scrum environment to write 60 user acceptance tests for said APIs using Serenity BDD"
      },
      {
        "company": "The Zebra",
        "title": "Software Engineer Intern",
        "years": "May 2020 - August 2020",
        "description": "• Reduced unnecessary reporting by 50% from error-detection software (Sentry)through redesigned approach to catching exceptions in Tornado (Python framework), made possible through daily Agile refinements • Spearheaded Angular tooling improvementsfor search optimization, user graph display, and file accessibility for DBT Docs, a data documentation tool used by over 100 internal engineers • Created open-source contributions to the official DBT Docs code repository on GitHub to be a part of DBT Docs v0.18.0 • Consolidated the user documentation process by creating an OpenAPI documentation page for a data pipeline project"
      }
    ],
    "skills": [
      {
        "name": "Java (including Springboot)",
        "level": "80%"
      },
      {
        "name": "JavaScript (including Angular, React)",
        "level": "80%"
      },
      {
        "name": "HTML",
        "level": "80%"
      },
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "Python (including Tornado)",
        "level": "80%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "CI/CD Pipelines",
        "level": "60%"
      },
      {
        "name": "C",
        "level": "50%"
      },
      {
        "name": "C++",
        "level": "50%"
      },
      {
        "name": "Node.js (Express)",
        "level": "50%"
      },
      {
        "name": "Go (including Fiber)",
        "level": "50%"
      },
      {
        "name": "SQL",
        "level": "40%"
      },
      {
        "name": "Jest",
        "level": "40%"
      },
      {
        "name": "Serenity BDD",
        "level": "40%"
      },
      {
        "name": "AWS (including Sandbox, EC2)",
        "level": "40%"
      },
      {
        "name": "Docker",
        "level": "40%"
      },
      {
        "name": "Google Cloud",
        "level": "40%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Project Ryde",
        "category": "A robust hardware checkout system built using React and Express",
        "image": "projectrydelogo.JPG",
        "url": "https://github.com/stephen8chang/project-ryde"
      },
      {
        "title": "Foodability",
        "category": "Award-winning restaurant rating app for physically disabled individuals",
        "image": "foodabilitylogo.jpg",
        "url": "https://devpost.com/software/foodability"
      },
      {
        "title": "Yash (Yet Another Shell)",
        "category": "Recreation of a of Linux Shell using a standard C library",
        "image": "yashlogo.jpg",
        "url": "https://github.com/stephen8chang/OperatingSystems-LinuxShell"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
